7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_Ethernet.h
#define  _Ethernet_PTP_PTPTSHUR_TSUS                         (0xffffffff << 0)    // TSUS
#define  _Ethernet_PTP_PTPTSLUR_TSUSS                        (0x7fffffff << 0)    // TSUSS
#define  _Ethernet_PTP_PTPTSLUR_TSUPNS                       (0x1 << 31)    // TSUPNS
#define  _Ethernet_PTP_PTPTSAR_TSA                           (0xffffffff << 0)    // TSA
#define  _Ethernet_PTP_PTPTTHR_TTSH                          (0xffffffff << 0)    // 0
#define  _Ethernet_PTP_PTPTTLR_TTSL                          (0xffffffff << 0)    // TTSL
#define  _Ethernet_PTP_PTPTSSR_TSSO                          (0x1 << 0)    // TSSO
#define  _Ethernet_PTP_PTPTSSR_TSTTR                         (0x1 << 1)    // TSTTR
#define  _Ethernet_PTP_PTPPPSCR_TSSO                         (0x1 << 0)    // TSSO
#define  _Ethernet_PTP_PTPPPSCR_TSTTR                        (0x1 << 1)    // TSTTR
#define  _Ethernet_DMA_DMABMR_SR                             (0x1 << 0)    // SR
#define  _Ethernet_DMA_DMABMR_DA                             (0x1 << 1)    // DA
#define  _Ethernet_DMA_DMABMR_DSL                            (0x1f << 2)    // DSL
#define  _Ethernet_DMA_DMABMR_EDFE                           (0x1 << 7)    // EDFE
#define  _Ethernet_DMA_DMABMR_PBL                            (0x3f << 8)    // PBL
#define  _Ethernet_DMA_DMABMR_RTPR                           (0x3 << 14)    // RTPR
#define  _Ethernet_DMA_DMABMR_FB                             (0x1 << 16)    // FB
#define  _Ethernet_DMA_DMABMR_RDP                            (0x3f << 17)    // RDP
#define  _Ethernet_DMA_DMABMR_USP                            (0x1 << 23)    // USP
#define  _Ethernet_DMA_DMABMR_FPM                            (0x1 << 24)    // FPM
#define  _Ethernet_DMA_DMABMR_AAB                            (0x1 << 25)    // AAB
#define  _Ethernet_DMA_DMABMR_MB                             (0x1 << 26)    // MB
#define  _Ethernet_DMA_DMATPDR_TPD                           (0xffffffff << 0)    // TPD
#define  _Ethernet_DMA_DMARPDR_RPD                           (0xffffffff << 0)    // RPD
#define  _Ethernet_DMA_DMARDLAR_SRL                          (0xffffffff << 0)    // SRL
#define  _Ethernet_DMA_DMATDLAR_STL                          (0xffffffff << 0)    // STL
#define  _Ethernet_DMA_DMASR_TS                              (0x1 << 0)    // TS
#define  _Ethernet_DMA_DMASR_TPSS                            (0x1 << 1)    // TPSS
#define  _Ethernet_DMA_DMASR_TBUS                            (0x1 << 2)    // TBUS
#define  _Ethernet_DMA_DMASR_TJTS                            (0x1 << 3)    // TJTS
#define  _Ethernet_DMA_DMASR_ROS                             (0x1 << 4)    // ROS
#define  _Ethernet_DMA_DMASR_TUS                             (0x1 << 5)    // TUS
#define  _Ethernet_DMA_DMASR_RS                              (0x1 << 6)    // RS
#define  _Ethernet_DMA_DMASR_RBUS                            (0x1 << 7)    // RBUS
#define  _Ethernet_DMA_DMASR_RPSS                            (0x1 << 8)    // RPSS
#define  _Ethernet_DMA_DMASR_PWTS                            (0x1 << 9)    // PWTS
#define  _Ethernet_DMA_DMASR_ETS                             (0x1 << 10)    // ETS
#define  _Ethernet_DMA_DMASR_FBES                            (0x1 << 13)    // FBES
#define  _Ethernet_DMA_DMASR_ERS                             (0x1 << 14)    // ERS
#define  _Ethernet_DMA_DMASR_AIS                             (0x1 << 15)    // AIS
#define  _Ethernet_DMA_DMASR_NIS                             (0x1 << 16)    // NIS
#define  _Ethernet_DMA_DMASR_RPS                             (0x7 << 17)    // RPS
#define  _Ethernet_DMA_DMASR_TPS                             (0x7 << 20)    // TPS
#define  _Ethernet_DMA_DMASR_EBS                             (0x7 << 23)    // EBS
#define  _Ethernet_DMA_DMASR_MMCS                            (0x1 << 27)    // MMCS
#define  _Ethernet_DMA_DMASR_PMTS                            (0x1 << 28)    // PMTS
#define  _Ethernet_DMA_DMASR_TSTS                            (0x1 << 29)    // TSTS
#define  _Ethernet_DMA_DMAOMR_SR                             (0x1 << 1)    // SR
#define  _Ethernet_DMA_DMAOMR_OSF                            (0x1 << 2)    // OSF
#define  _Ethernet_DMA_DMAOMR_RTC                            (0x3 << 3)    // RTC
#define  _Ethernet_DMA_DMAOMR_FUGF                           (0x1 << 6)    // FUGF
#define  _Ethernet_DMA_DMAOMR_FEF                            (0x1 << 7)    // FEF
#define  _Ethernet_DMA_DMAOMR_ST                             (0x1 << 13)    // ST
#define  _Ethernet_DMA_DMAOMR_TTC                            (0x7 << 14)    // TTC
#define  _Ethernet_DMA_DMAOMR_FTF                            (0x1 << 20)    // FTF
#define  _Ethernet_DMA_DMAOMR_TSF                            (0x1 << 21)    // TSF
#define  _Ethernet_DMA_DMAOMR_DFRF                           (0x1 << 24)    // DFRF
#define  _Ethernet_DMA_DMAOMR_RSF                            (0x1 << 25)    // RSF
#define  _Ethernet_DMA_DMAOMR_DTCEFD                         (0x1 << 26)    // DTCEFD
#define  _Ethernet_DMA_DMAIER_TIE                            (0x1 << 0)    // TIE
#define  _Ethernet_DMA_DMAIER_TPSIE                          (0x1 << 1)    // TPSIE
#define  _Ethernet_DMA_DMAIER_TBUIE                          (0x1 << 2)    // TBUIE
#define  _Ethernet_DMA_DMAIER_TJTIE                          (0x1 << 3)    // TJTIE
#define  _Ethernet_DMA_DMAIER_ROIE                           (0x1 << 4)    // ROIE
#define  _Ethernet_DMA_DMAIER_TUIE                           (0x1 << 5)    // TUIE
#define  _Ethernet_DMA_DMAIER_RIE                            (0x1 << 6)    // RIE
#define  _Ethernet_DMA_DMAIER_RBUIE                          (0x1 << 7)    // RBUIE
#define  _Ethernet_DMA_DMAIER_RPSIE                          (0x1 << 8)    // RPSIE
#define  _Ethernet_DMA_DMAIER_RWTIE                          (0x1 << 9)    // RWTIE
#define  _Ethernet_DMA_DMAIER_ETIE                           (0x1 << 10)    // ETIE
#define  _Ethernet_DMA_DMAIER_FBEIE                          (0x1 << 13)    // FBEIE
#define  _Ethernet_DMA_DMAIER_ERIE                           (0x1 << 14)    // ERIE
#define  _Ethernet_DMA_DMAIER_AISE                           (0x1 << 15)    // AISE
#define  _Ethernet_DMA_DMAIER_NISE                           (0x1 << 16)    // NISE
#define  _Ethernet_DMA_DMAMFBOCR_MFC                         (0xffff << 0)    // MFC
#define  _Ethernet_DMA_DMAMFBOCR_OMFC                        (0x1 << 16)    // OMFC
#define  _Ethernet_DMA_DMAMFBOCR_MFA                         (0x7ff << 17)    // MFA
#define  _Ethernet_DMA_DMAMFBOCR_OFOC                        (0x1 << 28)    // OFOC
#define  _Ethernet_DMA_DMARSWTR_RSWTC                        (0xff << 0)    // RSWTC
#define  _Ethernet_DMA_DMACHTDR_HTDAP                        (0xffffffff << 0)    // HTDAP
#define  _Ethernet_DMA_DMACHRDR_HRDAP                        (0xffffffff << 0)    // HRDAP
#define  _Ethernet_DMA_DMACHTBAR_HTBAP                       (0xffffffff << 0)    // HTBAP
#define  _Ethernet_DMA_DMACHRBAR_HRBAP                       (0xffffffff << 0)    // HRBAP
